<a href="https://colab.research.google.com/github/kopiladevkota/Python/blob/main/2_Working_with_Multiple_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
---

<center><h1> üìç üìç Working with Multiple DataFrames üìç üìç </h1></center>


---

- In most of the real life projects you will not get data from a single resource. You might need to combine data that you gather from multiple sources. In this notebook, we will see how to work with multiple data files?


***We have already worked with big mart sales data. Here, we have divided the data based on different outlet size. Let's see how to work with the multiple files***


---

#### `READ THE DATA`

---

In [ ]:
# importing the pandas library
import pandas as pd

---

***Read 3 different files `outlet_size_small.csv`, `outlet_size_medium.csv` and `outlet_size_high.csv` stored in the folder datasets.***

---

In [ ]:
# read the datasets
outlet_size_small = pd.read_csv('datasets/outlet_size_small.csv')
outlet_size_medium = pd.read_csv('datasets/outlet_size_medium.csv')
outlet_size_large = pd.read_csv('datasets/outlet_size_high.csv')

***Let's check the shape of the data.***

---

In [ ]:
outlet_size_small.shape, outlet_size_medium.shape, outlet_size_large.shape

***So, there are 2388 small, 2793 medium and 932 large size outlets are there.***


---

***Let's have a look at the data***

#### `OUTLET SIZE SMALL`
---

In [ ]:
outlet_size_small.head()

#### `OUTLET SIZE MEDIUM`

---

In [ ]:
outlet_size_medium.head()

#### `OUTLET SIZE LARGE`

---

In [ ]:
outlet_size_large.head()

---

#### `CONCATENATE ALL THE DATAFRAMES`


We will use the concat function to concatenate all the dataframes. You just need to pass the list of dataframes to concatenate.

---

#### `FOR ROW-WISE CONCATENATION USE AXIS=0`


---

In [ ]:
# dataframes list
all_dataframes = [outlet_size_small, outlet_size_medium, outlet_size_large]

In [ ]:
# concatenate all the dataframes
data = pd.concat(all_dataframes, axis=0)

In [ ]:
# shape of the data
data.shape

#### `FOR COLUMN-WISE CONCATENATION USE AXIS=1`


It is not advised to concatenate dataframes column wise. If you want to then you need to take care of some checks like the number of rows must be same in both the dataframes. Indexes are sorted of both the dataframes. If you are done with all the checks then you can simply use `axis=1` to do the job.



Let's see with the help of an example.


---

In [ ]:
sample_dataframe = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Aravind', 'Rahul', 'Prateek', 'Piyuesh', 'Kartik'],
    'grade': ['B', 'B', 'A', 'C', 'A'],
    'marks': [ 15, 15, 20, 4, 22],
    'city' : ['Gurugram', 'Delhi', 'Delhi', 'Gurugram', 'Hyderabad']
})
sample_dataframe

***Let's create a dataframe which contains column name `phone_no`. Here, we are assuming that order of phone numbers are correct as the order of names in the sample_dataframe.***

---

In [ ]:
# another sample dataframe
phone_no = pd.DataFrame({ 'phone_no' : [212202, 202021, 212334, 213431, 211721]})
phone_no

In [ ]:
combined = pd.concat([sample_dataframe,phone_no], axis=1)
combined

---

#### `Performing SQL-Like Joins in Pandas`


#### `LET'S LEARN ABOUT THE JOINS IN PANDAS WITH SOME EXAMPLES`

- We will create a sample dataframe of students data that will contain `roll_no`, `name`, `grade`, `marks` and `city`.


---

In [ ]:
student_df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Aravind', 'Rahul', 'Prateek', 'Piyuesh', 'Kartik'],
    'grade': ['B', 'B', 'A', 'C', 'A'],
    'marks': [ 15, 15, 20, 4, 22],
    'city' : ['Gurugram', 'Delhi', 'Delhi', 'Gurugram', 'Hyderabad']
})
student_df

   roll_no     name grade  marks       city
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
2      104  Prateek     A     20      Delhi
3      103  Piyuesh     C      4   Gurugram
4      105   Kartik     A     22  Hyderabad

---

***Now, we have a mapping of city and state. We want to add another feature to our dataframe state using this mapping.***


Let's create the city_state_mapping

---

In [ ]:
city_state_mapping = pd.DataFrame({
    'city' :  ['Gurugram', 'Delhi', 'Hyderabad', 'Faridabad'],
    'state' : ['Haryana',  'Delhi', 'Telangana', 'Haryana']
})
city_state_mapping

        city      state
0   Gurugram    Haryana
1      Delhi      Delhi
2  Hyderabad  Telangana
3  Faridabad    Haryana

***Now, we want to add another column state to the `student_df` using the `city_state_mapping`. We can do this by doing a left join. We need to use the merge function and set the parameters `how='left'` and `on='city`.***

![](left.png)
---

In [ ]:
city_state_mapping

        city      state
0   Gurugram    Haryana
1      Delhi      Delhi
2  Hyderabad  Telangana
3  Faridabad    Haryana

In [ ]:
student_df.merge(city_state_mapping, how='left', on='city')

   roll_no     name grade  marks       city      state
0      102  Aravind     B     15   Gurugram    Haryana
1      101    Rahul     B     15      Delhi      Delhi
2      104  Prateek     A     20      Delhi      Delhi
3      103  Piyuesh     C      4   Gurugram    Haryana
4      105   Kartik     A     22  Hyderabad  Telangana

***Now, we have another dataframe that contains roll_no of some students. We need to find out the other details of the students. We can do this by using `right join`. You just need to set `how='right'`.***

![](right.png)
---

In [ ]:
roll_no = pd.DataFrame({
    'roll_no' : [ 102, 103]
})
roll_no

   roll_no
0      102
1      103

In [ ]:
student_df

   roll_no     name grade  marks       city
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
2      104  Prateek     A     20      Delhi
3      103  Piyuesh     C      4   Gurugram
4      105   Kartik     A     22  Hyderabad

In [ ]:
student_df.merge(roll_no, how='right', on='roll_no')

   roll_no     name grade  marks      city
0      102  Aravind     B     15  Gurugram
1      103  Piyuesh     C      4  Gurugram

***Now, students participated in a placement drive and some of the students got placed and the details are given in the `student_selection` dataframe.***

---

In [ ]:
student_selection = pd.DataFrame({
    'roll_no' : [102, 105, 101],
    'company' : ['ABC', 'XYZ', 'ABC'],
    'package (lpa)' : [ 8, 14.5, 11 ]
})
student_selection

   roll_no company  package (lpa)
0      102     ABC            8.0
1      105     XYZ           14.5
2      101     ABC           11.0

***Now, we want to combine the `student_df` and `student_selection`. We can do this by using `outer/full join`. You need to set parameter `how = 'outer'`.***

![](outer.png)

---

In [ ]:
student_df

   roll_no     name grade  marks       city
0      102  Aravind     B     15   Gurugram
1      101    Rahul     B     15      Delhi
2      104  Prateek     A     20      Delhi
3      103  Piyuesh     C      4   Gurugram
4      105   Kartik     A     22  Hyderabad

In [ ]:
student_df.merge(student_selection, how='outer')

   roll_no     name grade  marks       city company  package (lpa)
0      102  Aravind     B     15   Gurugram     ABC            8.0
1      101    Rahul     B     15      Delhi     ABC           11.0
2      104  Prateek     A     20      Delhi     NaN            NaN
3      103  Piyuesh     C      4   Gurugram     NaN            NaN
4      105   Kartik     A     22  Hyderabad     XYZ           14.5

---

***Now, consider it was a pool placement drive and students from multiple colleges participated. The college `"ZU UNIVERSITY"` got the list of students selected for the job. You need to find out the details of the students who got selected from the college `"ZU UNIVERSITY"`***


---

In [ ]:
student_df = pd.DataFrame({
    'college': ['ZU UNIVERSITY', 'ZU UNIVERSITY', 'ZU UNIVERSITY', 'ZU UNIVERSITY', 'ZU UNIVERSITY'],
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Aravind', 'Rahul', 'Prateek', 'Piyuesh', 'Kartik'],
    'grade': ['B', 'B', 'A', 'C', 'A'],
    'marks': [ 15, 15, 20, 4, 22],
    'city' : ['Gurugram', 'Delhi', 'Delhi', 'Gurugram', 'Hyderabad']
})
student_df

         college  roll_no     name grade  marks       city
0  ZU UNIVERSITY      102  Aravind     B     15   Gurugram
1  ZU UNIVERSITY      101    Rahul     B     15      Delhi
2  ZU UNIVERSITY      104  Prateek     A     20      Delhi
3  ZU UNIVERSITY      103  Piyuesh     C      4   Gurugram
4  ZU UNIVERSITY      105   Kartik     A     22  Hyderabad

In [ ]:
pool = pd.DataFrame({
        'college': ['ZU UNIVERSITY', 'ZU UNIVERSITY', 'AB UNIVERSITY', 'ZU UNIVERSITY','AB UNIVERSITY'],
        'name' : ['Aravind', 'Rahul', 'Rahul', 'Prateek', 'Harsh'],
        'company' : ['ABC', 'XYZ', 'ABC', 'AEP', 'ABC'],
        'package (lpa)' : [ 8, 14.5, 11, 6, 6 ]
})
pool

         college     name company  package (lpa)
0  ZU UNIVERSITY  Aravind     ABC            8.0
1  ZU UNIVERSITY    Rahul     XYZ           14.5
2  AB UNIVERSITY    Rahul     ABC           11.0
3  ZU UNIVERSITY  Prateek     AEP            6.0
4  AB UNIVERSITY    Harsh     ABC            6.0

---

***Now, we have 2 columns common `college` and `name` in both the dataframes. So, here we will use the `inner join`. You just need to set the parameters `how='inner'` and as we have 2 common columns therefore, set the parameter `on=['college','name']`.***


![](inner.png)

---

In [ ]:
student_df.merge(pool, how='inner', on=['college', 'name'])

,college,roll_no,name,grade,marks,city,company,package (lpa)
0,ZU UNIVERSITY,102,Aravind,B,15,Gurugram,ABC,8.0
1,ZU UNIVERSITY,101,Rahul,B,15,Delhi,XYZ,14.5
2,ZU UNIVERSITY,104,Prateek,A,20,Delhi,AEP,6.0

---

### `NOW LET'S SOLVE THE PROBLEM`

---

We have another dataset `outlet_data.csv` in the dataset folder. It has column `Outlet_Identifier`, `Outlet_Establishment_Year`, `Outlet_Size` and `Outlet_Location_Type`.


Now, we have `Outlet_Identifier` in both the datasets and we need to combine them and get the rest of the variables in our dataset. So we will do a `left join` to merge the data frames. Let's see how?

---


#### `READ THE OUTLET DATA`

---

In [ ]:
### all merges with sample

In [ ]:
previous_data = pd.read_csv('datasets/outlet_size_concatenated_data.csv')

In [ ]:
previous_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Type,Item_Outlet_Sales
0,FDA03,18.50,Regular,0.045464,Dairy,144.1102,OUT046,Supermarket Type1,2187.1530
1,FDS46,17.60,Regular,0.047257,Snack Foods,119.6782,OUT046,Supermarket Type1,2145.2076
2,FDP49,9.00,Regular,0.069089,Breakfast,56.3614,OUT046,Supermarket Type1,1547.3192
3,FDU02,13.35,Low Fat,0.102492,Dairy,230.5352,OUT035,Supermarket Type1,2748.4224
4,NCB30,14.60,Low Fat,0.025698,Household,196.5084,OUT035,Supermarket Type1,1587.2672

In [ ]:
# read the outlet data
outlet_data = pd.read_csv('datasets/outlet_data.csv')

In [ ]:
# view the top rows of the data
outlet_data.head()

,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type
0,OUT013,1987,High,Tier 3
1,OUT018,2009,Medium,Tier 3
2,OUT019,1985,Small,Tier 1
3,OUT027,1985,Medium,Tier 3
4,OUT035,2004,Small,Tier 2

---


***Use the merge function to set parameter `how = 'left'` for the left join and the set the on parameter as the common column name as `on='Outlet_Identifier'`.***


---

In [ ]:
# merge the data
combined_data = previous_data.merge(outlet_data, how='left', on='Outlet_Identifier')

In [ ]:
# view the data
combined_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Type,Item_Outlet_Sales,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type
0,FDA03,18.50,Regular,0.045464,Dairy,144.1102,OUT046,Supermarket Type1,2187.1530,1997,Small,Tier 1
1,FDS46,17.60,Regular,0.047257,Snack Foods,119.6782,OUT046,Supermarket Type1,2145.2076,1997,Small,Tier 1
2,FDP49,9.00,Regular,0.069089,Breakfast,56.3614,OUT046,Supermarket Type1,1547.3192,1997,Small,Tier 1
3,FDU02,13.35,Low Fat,0.102492,Dairy,230.5352,OUT035,Supermarket Type1,2748.4224,2004,Small,Tier 2
4,NCB30,14.60,Low Fat,0.025698,Household,196.5084,OUT035,Supermarket Type1,1587.2672,2004,Small,Tier 2

In [ ]:
combined_data.shape

(6113, 12)

----

So, you can see that we got some extra variables in the dataset.

----


***Now, we have a sample list of Item_Identifiers in a separate file `item_identifier.csv`. We are required to provide all the details that we have related to that particular Item_Identifier. Let's see how can we do that with the help of a `RIGHT JOIN`***

---


#### `READ THE DATA`

---

In [ ]:
# read the data
item_data = pd.read_csv('datasets/item_idenifier.csv')

In [ ]:
# view the top rows
item_data.head()

  Item_Identifier
0           DRI51
1           FDL48
2           FDL38
3           FDF17
4           FDN56

In [ ]:
item_data.shape

(100, 1)

***So, we have 100 Item_Identifiers and we need to provide the other details. We just need to use the merge function and set parameter `how='right'` and the common variable name is `Item_Identifier`.***

---

In [ ]:
item_details = combined_data.merge(item_data, how='right',on='Item_Identifier')

In [ ]:
item_details

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Type,Item_Outlet_Sales,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type
0,FDB11,16.000,Low Fat,0.060837,Starchy Foods,226.8404,OUT035,Supermarket Type1,6301.1312,2004,Small,Tier 2
1,FDB11,16.000,Low Fat,0.060943,Starchy Foods,225.6404,OUT049,Supermarket Type1,2925.5252,1999,Medium,Tier 1
2,FDB11,16.000,LF,0.060797,Starchy Foods,223.8404,OUT013,Supermarket Type1,3600.6464,1987,High,Tier 3
3,FDX20,7.365,Low Fat,0.042560,Fruits and Vegetables,226.1720,OUT046,Supermarket Type1,3169.2080,1997,Small,Tier 1
4,FDX20,7.365,Low Fat,0.042552,Fruits and Vegetables,225.1720,OUT035,Supermarket Type1,3395.5800,2004,Small,Tier 2
...,...,...,...,...,...,...,...,...,...,...,...,...
417,FDJ07,NaN,Low Fat,0.014354,Meat,115.5150,OUT027,Supermarket Type3,1631.2100,1985,Medium,Tier 3
418,FDF17,5.190,Low Fat,0.042687,Frozen Foods,195.9110,OUT049,Supermarket Type1,2946.1650,1999,Medium,Tier 1
419,FDV08,NaN,Low Fat,0.028456,Fruits and Vegetables,43.5454,OUT027,Supermarket Type3,755.0172,1985,Medium,Tier 3
420,FDV08,7.350,Low Fat,0.028711,Fruits and Vegetables,39.9454,OUT018,Supermarket Type2,377.5086,2009,Medium,Tier 3
421,FDV08,7.350,Low Fat,0.028571,Fruits and Vegetables,40.8454,OUT013,Supermarket Type1,587.2356,1987,High,Tier 3